In [178]:
import numpy as np
import pandas as pd
import random

In [179]:
random.seed(123)

In [180]:
fn = "../data/deped_school_location_with_enrolment_2017_2018.csv"
df = pd.read_csv(fn)

In [181]:
fn_out = "../input/schools_for_geocoding.csv"

In [182]:
df.head(3)

,SCHOOL ID,SCHOOL NAME,ADDRESS,REGION,DIVISION,MUNICIPALITY,BARANGGAY,LATITUDE,LONGITUDE,MAPPED
0,100160,Adams CES,"Pob. 1, Adams, Ilocos Norte",Region I,Ilocos Norte,ADAMS,ADAMS (POB.),18.462302,120.901845,1
1,100163,Bucarot PS,"Bucarot, Adams, Ilocos Norte",Region I,Ilocos Norte,ADAMS,ADAMS (POB.),18.462088,120.903605,1
2,150007,MALAGGAO PS,"Malaggao, Adams, Ilocos Norte",Region I,Ilocos Norte,ADAMS,ADAMS (POB.),18.458749,120.905469,1

In [183]:
len(df)

47358

In [184]:
for col in df.columns:
    print col, df[col].dtype

SCHOOL ID int64
SCHOOL NAME object
ADDRESS object
REGION object
DIVISION object
MUNICIPALITY object
BARANGGAY object
LATITUDE object
LONGITUDE float64
MAPPED int64

In [185]:
df["MAPPED"].value_counts()

1    42214
0     5144
Name: MAPPED, dtype: int64

In [186]:
df1 = df[df["MAPPED"]==1] #mapped
df2 = df[df["MAPPED"]==0] #not mapped
len(df1), len(df2)

(42214, 5144)

In [187]:
# select 1000 records randomly from the mapped schools
nrand = 1000
irand = random.sample(df1.index,nrand)
df1r = df1.loc[irand,:]

In [188]:
df1r.head(5)

,SCHOOL ID,SCHOOL NAME,ADDRESS,REGION,DIVISION,MUNICIPALITY,BARANGGAY,LATITUDE,LONGITUDE,MAPPED
2327,102059,Salvacion ES,M. Agustin St.,Region I,"Pangasinan II, Binalonan",SANTO TOMAS,SALVACION,15.881154,120.592139,1
3908,103178,Rang-ay Elementary School,NOT APPLICABLE,Region II,Isabela,CABATUAN,RANG-AY (CAGGONG),16.92228611,121.613419,1
18640,114603,Tabaco North CS,"Bombon, Tabaco City",Region V,Tabaco City,CITY OF TABACO,BOMBON (POB.),13.361281,123.725157,1
5275,300505,Cabulay High School,"-Blanco St., Purok 3",Region II,Santiago City,CITY OF SANTIAGO,CABULAY,16.719275,121.502084,1
40965,132103,West Tungao ES,"P-25, San Roque, Tungao, ButuanCity",CARAGA,Butuan City,BUTUAN CITY (Capital),TUNGAO,8.947537,125.540626,1

In [189]:
len(df1r)

1000

In [190]:
# combine the two lists
df_out = pd.concat([df2, df1r])

In [191]:
len(df1r), len(df2), len(df_out)

(1000, 5144, 6144)

In [192]:
df_out.describe()

          SCHOOL ID    LONGITUDE       MAPPED
count  6.144000e+03  1000.000000  6144.000000
mean   3.122746e+05   122.860299     0.162760
std    3.190985e+05     1.809283     0.369177
min    1.000000e+05   117.243942     0.000000
25%    1.322652e+05   121.126434     0.000000
50%    1.805030e+05   122.942761     0.000000
75%    3.422342e+05   124.438579     0.000000
max    1.600194e+06   126.383680     1.000000

In [193]:
len(df_out)

6144

In [194]:
# define full school name 
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME"].str.upper()
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace(" CES", " Central Elementary School")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace(" CS", " Central School")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace(" ES", " Elementary School")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace(" E/S", " Elementary School")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace(" ELEM. SCHOOL", " Elementary School")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace(" INTEG. SCH.", " Integrated School")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace(" IS", " Integrated School")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace(" MNHS", " Memorial National High School")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace(" MEM. NATIONAL", " Memorial National")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace(" NHS", " National High School")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace(" SHS", " Senior High School")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace("SHS ", "Senior High School ")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace(" HS", " High School")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace(" PS", " Primary School")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace(" P/S", " Primary School")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace("TUBIGKUTAHPS", "TubigKutah Primary School")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace("GNHS", "Guihulngan National High School")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace(" VOC", " VOCATIONAL")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace(" NTS", " NATIONAL TRADE SCHOOL")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace(" NSTS", " NATIONAL SECONDARY TRADE SCHOOL")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace(" MS", " Memorial School")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace(" MES", " Memorial Elementary School")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace(" COMM. SCH.", " Community School")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace(" RVS", " Rural and Vocational School")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace(" SOF", " School of Fisheries")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace("MALAPOC SUR MGS", "Malapoc Sur Elementary School")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.replace("PHI SCIENCE", "PHILIPPINE SCIENCE")
df_out["SCHOOL NAME2"] = df_out["SCHOOL NAME2"].str.upper()

In [195]:
# convert all strings to upper case
for col in "SCHOOL NAME", "ADDRESS", "REGION", "DIVISION", "MUNICIPALITY", "BARANGGAY":
    df_out[col] = df_out[col].str.upper()

In [196]:
df_out.head(2)

,SCHOOL ID,SCHOOL NAME,ADDRESS,REGION,DIVISION,MUNICIPALITY,BARANGGAY,LATITUDE,LONGITUDE,MAPPED,SCHOOL NAME2
35,500000,CARAITAN INTEGRATED SCHOOL,"CARAITAN, BADOC, ILOCOS NORTE",REGION I,ILOCOS NORTE,BADOC,CARAITAN,NaN,NaN,0,CARAITAN INTEGRATED SCHOOL
174,500594,UGUIS INTEGRATED SCHOOL,"BRGY. 9, UGUIS",REGION I,ILOCOS NORTE,NUEVA ERA,UGUIS,NaN,NaN,0,UGUIS INTEGRATED SCHOOL

In [197]:
# create input text address for geocoding
# address1 - with school name
# address2 - without school name; for validating if coordinates are tied to the school
df_out["ADDRESS"] = df_out["ADDRESS"].fillna("")
# start with the school name and address
address = df_out["ADDRESS"]
# if not included, add barangay 
sub = df_out.loc[df_out["BARANGGAY"].isin(address)==False, "BARANGGAY"]
address[df_out["BARANGGAY"].isin(address)==False] = address[df_out["BARANGGAY"].isin(address)==False] + ", BRGY. " + sub 
# if not included, add municipality
sub = df_out.loc[df_out["MUNICIPALITY"].isin(address)==False, "MUNICIPALITY"]
address[df_out["MUNICIPALITY"].isin(address)==False] = address[df_out["MUNICIPALITY"].isin(address)==False] + ", " + sub 
# add country
address = address + ", PHILIPPINES"
# set ADDRESS1, ADDRESS2
df_out["ADDRESS1"] = df_out["SCHOOL NAME2"] + ", " + address # with expanded school name
df_out["ADDRESS2"] = address

/opt/anaconda2/lib/python2.7/site-packages/ipykernel_launcher.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':
/opt/anaconda2/lib/python2.7/site-packages/ipykernel_launcher.py:12: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if sys.path[0] == '':

In [198]:
df_out.to_csv(fn_out, index=False)

In [199]:
len(df_out)

6144